//================================================================================================================
//
// DirectXのゲームクリア画面表示処理 [gameclear.cpp]
// Author : TENMA
//
//================================================================================================================
#include "main.h"
#include "gameclear.h"
#include "gameclearBg.h"
#include "gameclearEffect.h"
#include "input.h"
#include "sound.h"
#include "fade.h"

// マクロ定義
#define FADE_COUNT		(120)						// リザルト画面へ遷移するまでの時間

// グローバル変数
int g_nCounterGameclear = 0;						// リザルト画面へ遷移するまでのカウンター

//================================================================================================================
// ゲームオーバー画面の初期化処理
//================================================================================================================
void InitGameclear(void)
{
	g_nCounterGameclear = 0;

	// タイトル画面のBGM再生
	PlaySound(SOUND_LABEL_BGM004);
}

//================================================================================================================
// ゲームオーバー画面の終了処理
//================================================================================================================
void UninitGameclear(void)
{
	// BGMの停止
	StopSound();
}

//================================================================================================================
// ゲームオーバー画面の更新処理
//================================================================================================================
void UpdateGameclear(void)
{
	// Enterでタイトル画面へ進む
	if ((GetJoypadAny() == true
		|| GetKeyboardTrigger(DIK_RETURN) == true
		|| g_nCounterGameclear >= FADE_COUNT) == true 
		&& GetFade() == FADE_NONE)
	{
		PlaySound(SOUND_LABEL_SE_ENTER);
		SetFade(MODE_RESULT);
	}

	g_nCounterGameclear++;
}

//================================================================================================================
// ゲームオーバー画面の描画処理
//================================================================================================================
void DrawGameclear(void)
{

}